In [1]:
import pandas  as pd
import numpy as np

In [2]:
data = {'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']}

1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [4]:
df=pd.DataFrame(data)

In [5]:
df.dtypes

From_To          object
FlightNumber    float64
RecentDelays     object
Airline          object
dtype: object

In [6]:
import copy

In [7]:
df_temp = copy.deepcopy(df)

In [8]:
id(df)

140145073942992

In [9]:
id(df_temp)

140145074295184

In [10]:
df_temp

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [11]:
df_temp['FlightNumber'] = df_temp['FlightNumber'].fillna(10)

In [12]:
df_temp

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN          10.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis          10.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [13]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [14]:
df_temp['FlightNumber'] = df_temp['FlightNumber'].astype(int)

In [15]:
df_temp['FlightNumber'].dtype

dtype('int64')

In [16]:
df_temp

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN            10            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis            10          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [17]:
df_temp.rename(columns={'From_To':'From'},inplace=True)

In [18]:
df_temp['From']

0        LoNDon_paris
1        MAdrid_miLAN
2    londON_StockhOlm
3      Budapest_PaRis
4     Brussels_londOn
Name: From, dtype: object

In [19]:
df_temp['From']=df_temp['From'].str.split('_')

In [20]:
df_temp['From'][0][1]

'paris'

In [21]:
df_temp['To']=0

In [22]:

for i in range(5):
    df_temp['To'][i]=df_temp['From'][i][1]

/home/rajesh/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/home/rajesh/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:671: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

In [25]:

for i in range(5):
    df_temp['From'][i]=df_temp['From'][i][0]

/home/rajesh/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [26]:
df_temp

       From  FlightNumber  RecentDelays              Airline         To
0    LoNDon         10045      [23, 47]               KLM(!)      paris
1    MAdrid            10            []    <Air France> (12)      miLAN
2    londON         10065  [24, 43, 87]  (British Airways. )  StockhOlm
3  Budapest            10          [13]       12. Air France      PaRis
4  Brussels         10085      [67, 32]          "Swiss Air"     londOn

3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [27]:
df_temp['From'] = df_temp['From'].str.title()

In [28]:
df_temp['To'] = df_temp['To'].str.title()

In [29]:
df_temp

       From  FlightNumber  RecentDelays              Airline         To
0    London         10045      [23, 47]               KLM(!)      Paris
1    Madrid            10            []    <Air France> (12)      Milan
2    London         10065  [24, 43, 87]  (British Airways. )  Stockholm
3  Budapest            10          [13]       12. Air France      Paris
4  Brussels         10085      [67, 32]          "Swiss Air"     London

4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [30]:
df.drop(['From_To'],axis=1,inplace=True)

In [40]:
df.drop(['RecentDelays'],axis=1,inplace=True)

In [41]:
df_temp1 = pd.concat([df,df_temp],axis=1)

In [42]:
df_temp1

,FlightNumber,Airline,From,FlightNumber,RecentDelays,Airline,To
0,10045.0,KLM(!),London,10045,"[23, 47]",KLM(!),Paris
1,NaN,<Air France> (12),Madrid,10,[],<Air France> (12),Milan
2,10065.0,(British Airways. ),London,10065,"[24, 43, 87]",(British Airways. ),Stockholm
3,NaN,12. Air France,Budapest,10,[13],12. Air France,Paris
4,10085.0,"""Swiss Air""",Brussels,10085,"[67, 32]","""Swiss Air""",London

In [67]:
df_temp4 = copy.deepcopy(df_temp1)

In [69]:
df_temp4

,FlightNumber,Airline,From,FlightNumber,RecentDelays,Airline,To
0,10045.0,KLM(!),London,10045,"[23, 47]",KLM(!),Paris
1,NaN,<Air France> (12),Madrid,10,[],<Air France> (12),Milan
2,10065.0,(British Airways. ),London,10065,"[24, 43, 87]",(British Airways. ),Stockholm
3,NaN,12. Air France,Budapest,10,[13],12. Air France,Paris
4,10085.0,"""Swiss Air""",Brussels,10085,"[67, 32]","""Swiss Air""",London

In [70]:
df_temp5=pd.DataFrame(df_temp4["RecentDelays"].to_list(), columns=['RecentDelays_1', 'RecentDelays_2','RecentDelays_3'])

In [71]:
df_temp6 = pd.concat([df_temp4,df_temp5],axis=1)

In [72]:
df_temp6

,FlightNumber,Airline,From,FlightNumber,RecentDelays,Airline,To,RecentDelays_1,RecentDelays_2,RecentDelays_3
0,10045.0,KLM(!),London,10045,"[23, 47]",KLM(!),Paris,23.0,47.0,NaN
1,NaN,<Air France> (12),Madrid,10,[],<Air France> (12),Milan,NaN,NaN,NaN
2,10065.0,(British Airways. ),London,10065,"[24, 43, 87]",(British Airways. ),Stockholm,24.0,43.0,87.0
3,NaN,12. Air France,Budapest,10,[13],12. Air France,Paris,13.0,NaN,NaN
4,10085.0,"""Swiss Air""",Brussels,10085,"[67, 32]","""Swiss Air""",London,67.0,32.0,NaN